import math 
'''
k1 - номер квартиры 
m - всего этажей 

k2 - номер квартиры № 2
p2 - подъезд квартиры № 2
n2 - этаж квартиры № 2

(кол во квартир одинаково на этаже)
(дом один и тот же)
89 20 | 41 1 11 | 4 квартиры на этаже | 80 в подъезде 
2 3
-----
p1 - подъезд 1 квартиры?
n1 - этаж 1 квартиры?
'''
def f(k1, m, k2, p2, n2):
    rooms_per_floor = math.ceil(k2 / n2) 
    rooms_per_padik = rooms_per_floor * m 

    p1 = math.ceil(k1 / rooms_per_padik)

    n1 = math.ceil((k1 - rooms_per_padik) / rooms_per_floor)

    return [p1, n1]
    



assert f(89, 20, 41, 1, 11) == [2, 3]
assert f(11, 1, 1, 1, 1) == [0, 1]
assert f(3, 2, 2, 2, 1) == [-1, -1]
assert f(16, 2, 15, 2, 1) == [2, 0]
assert f(17, 2, 15, 2, 1) == [2, 0]
assert f(18, 2, 15, 2, 1) == [2, 0]
assert f(19, 2, 15, 2, 1) == [2, 0]
assert f(20, 2, 15, 2, 1) == [2, 0]
assert f(21, 2, 15, 2, 1) == [0, 0]
assert f(22, 2, 15, 2, 1) == [0, 0]
assert f(23, 2, 15, 2, 1) == [0, 0]
assert f(24, 2, 15, 2, 1) == [0, 0]
assert f(25, 2, 15, 2, 1) == [0, 0]
assert f(26, 2, 15, 2, 1) == [0, 0]
assert f(27, 2, 15, 2, 1) == [0, 0]
assert f(28, 2, 15, 2, 1) == [0, 0]
assert f(29, 2, 15, 2, 1) == [3, 0]
assert f(5, 20, 2, 1, 1) == [1, 0]
assert f(20, 20, 2, 1, 1) == [1, 0]
assert f(21, 20, 2, 1, 1) == [1, 0]
assert f(753, 10, 1000, 1, 1) == [1, 1]
assert f(10, 3, 50, 1, 50) == [-1, -1]
assert f(25, 3, 1, 1, 1) == [0, 0]
assert f(25, 3, 1, 1, 1) == [0, 0]
assert f(24, 3, 1, 1, 1) == [0, 0]
assert f(23, 3, 1, 1, 1) == [0, 0]
assert f(22, 3, 1, 1, 1) == [0, 0]
assert f(21, 3, 1, 1, 1) == [0, 0]
assert f(20, 3, 1, 1, 1) == [0, 0]
assert f(19, 3, 1, 1, 1) == [0, 0]
assert f(18, 3, 1, 1, 1) == [0, 0]
assert f(17, 3, 1, 1, 1) == [0, 0]
assert f(16, 3, 1, 1, 1) == [0, 0]
assert f(15, 3, 1, 1, 1) == [0, 0]
assert f(19, 3, 8, 1, 1) == [1, 0]
assert f(19, 3, 7, 1, 1) == [1, 0]
assert f(19, 3, 6, 1, 1) == [0, 0]
assert f(18, 3, 6, 1, 1) == [1, 0]
assert f(6, 3, 18, 1, 1) == [1, 1]
assert f(3, 1, 9, 7, 3) == [-1, -1]
assert f(3, 1, 2, 1, 1) == [0, 1]
assert f(2, 1, 1, 1, 1) == [0, 1]
assert f(3, 2, 2, 1, 1) == [1, 0]
assert f(2, 3, 1, 1, 1) == [1, 0]
assert f(842887, 10, 163729, 24, 8) == [123, 0]
assert f(20, 10, 4, 1, 5) == [-1, -1]
assert f(20, 10, 5, 1, 5) == [2, 10]
assert f(11, 2, 4, 1, 2) == [0, 2]

